swissdigitalnet/44-net/ESP32-44net-Tester/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# WROOM-32 carries 4MB. The default is 2MB, which the OTA layout does not fit.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table with two OTA slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Rollback: a firmware that cannot rejoin WiFi or bind its listener never
# marks itself valid, and the bootloader restores the previous image.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# HTTP server needs a few extra handlers (/, /ui, /ota, captive-portal probes)
CONFIG_HTTPD_MAX_URI_HANDLERS=12
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
